---
kind: method
id: M:Autodesk.Revit.DB.FormatValueOptions.GetFormatOptions
source: html/5d874359-9603-4b3c-a5d3-3ad9ffacfb1c.htm
---
# Autodesk.Revit.DB.FormatValueOptions.GetFormatOptions Method

Gets the FormatOptions to optionally override the default settings in the Units class.

## Syntax (C#)
```csharp
public FormatOptions GetFormatOptions()
```

## Returns
A copy of the FormatOptions.

## Remarks
By default, the FormatOptions represents default formatting
 (UseDefault is true) and the FormatOptions in the Units class will
 be used.